# BuiltInFailures.ImportFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures Class
BuiltInFailures Class Members See Also
---
Failures about ImportFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ImportFailures
```

Visual Basic
---
```text
Public NotInheritable Class ImportFailures
```

Visual C++
---
```text
public ref class ImportFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ImportFailures
# See Also
BuiltInFailures..::..ImportFailures Members
Autodesk.Revit.DB Namespace